- Pandas ?
- Series ?
- DataFrame?
- create df
- create/update columns 
- vectorized operations
- change values
- .loc => filtering

In [7]:

from typing import List
# %conda install pandas (if you do not alr have pandas)
import pandas as pd 

example_list: List[int] = [1, 2, 3, 4, 5]
type(example_list)

list

In [8]:
example_list.pop()

5

In [9]:
example_list

[1, 2, 3, 4]

In [10]:
s1 = pd.Series(example_list)
s1.index = ["A", "B", "C", "D"]

In [11]:
s1 ["A"] = 23

In [12]:
s1

A    23
B     2
C     3
D     4
dtype: int64

In [13]:
s1.index = range(4)
s1

0    23
1     2
2     3
3     4
dtype: int64

In [14]:
# Create df from dictionary 
names = ["Nate", "Rebecca", "Edwin", "Preston"]
age = [39, 40, 11, 7]
year = ["senior", "junior", "sophomore", "freshman"]

students = {
    "name": names,
    "age": age,
    "year": year
}
students_df = pd.DataFrame(students)
students_df

      name  age       year
0     Nate   39     senior
1  Rebecca   40     junior
2    Edwin   11  sophomore
3  Preston    7   freshman

In [15]:
import random 
# Create df from list of rows

players = ["Messi", "Mbappe", "Ronaldo", "Sala"]

cols = ["name", "goals/game", "games"]
data = [
    [player, random.random(), round(random.random() * 1000)] 
    for player in players
    ]
players_df = pd.DataFrame(data=data, columns = cols)
players_df

      name  goals/game  games
0    Messi    0.481100    445
1   Mbappe    0.877141    850
2  Ronaldo    0.298225    641
3     Sala    0.886381    934

In [16]:
# create/update columns

players_df["name"]

0      Messi
1     Mbappe
2    Ronaldo
3       Sala
Name: name, dtype: object

In [17]:
players_df["name"][0]

'Messi'

In [18]:
players_df["new_col"] = 0
players_df

      name  goals/game  games  new_col
0    Messi    0.481100    445        0
1   Mbappe    0.877141    850        0
2  Ronaldo    0.298225    641        0
3     Sala    0.886381    934        0

In [19]:
players_df["new_col"] = [i+1 for i in range(len(players_df))]
players_df

      name  goals/game  games  new_col
0    Messi    0.481100    445        1
1   Mbappe    0.877141    850        2
2  Ronaldo    0.298225    641        3
3     Sala    0.886381    934        4

In [20]:
(len(players_df))

4

In [21]:
players_df["new_col"] = players_df["goals/game"] * players_df["games"]
players_df

      name  goals/game  games     new_col
0    Messi    0.481100    445  214.089282
1   Mbappe    0.877141    850  745.569750
2  Ronaldo    0.298225    641  191.162111
3     Sala    0.886381    934  827.879764

In [22]:
# inline vs declaration 
# players_df.rename(columns={"new_col": "goals"}, inplace= True)
players_df = players_df.rename(columns={"new_col": "goals"})
players_df

      name  goals/game  games       goals
0    Messi    0.481100    445  214.089282
1   Mbappe    0.877141    850  745.569750
2  Ronaldo    0.298225    641  191.162111
3     Sala    0.886381    934  827.879764

In [23]:
players_df["name"] = players_df["name"].str.lower()
players_df

      name  goals/game  games       goals
0    messi    0.481100    445  214.089282
1   mbappe    0.877141    850  745.569750
2  ronaldo    0.298225    641  191.162111
3     sala    0.886381    934  827.879764

In [24]:
players_df[["name", "goals"]]

      name       goals
0    messi  214.089282
1   mbappe  745.569750
2  ronaldo  191.162111
3     sala  827.879764

In [25]:
# .loc[]

players_df = players_df.set_index("name")
players_df

         goals/game  games       goals
name
messi      0.481100    445  214.089282
mbappe     0.877141    850  745.569750
ronaldo    0.298225    641  191.162111
sala       0.886381    934  827.879764

In [26]:
players_df.loc["mbappe", "games"]

np.int64(850)

In [27]:
players_df = players_df.reset_index()
players_df

      name  goals/game  games       goals
0    messi    0.481100    445  214.089282
1   mbappe    0.877141    850  745.569750
2  ronaldo    0.298225    641  191.162111
3     sala    0.886381    934  827.879764

In [28]:
players_df.loc[0]

name               messi
goals/game        0.4811
games                445
goals         214.089282
Name: 0, dtype: object

In [29]:
players_df.loc[1:2, "games":"goals"]

   games       goals
1    850  745.569750
2    641  191.162111

In [30]:
players_df.loc[[0,3,2]]

      name  goals/game  games       goals
0    messi    0.481100    445  214.089282
3     sala    0.886381    934  827.879764
2  ronaldo    0.298225    641  191.162111

In [31]:
players_df.loc[players_df["goals/game"]> 0.5]

     name  goals/game  games       goals
1  mbappe    0.877141    850  745.569750
3    sala    0.886381    934  827.879764

In [32]:
players_df.loc[players_df["goals/game"]> 0.5, "name"]

1    mbappe
3      sala
Name: name, dtype: object

In [34]:
players_df.loc[players_df["goals/game"]>0.5, "name"] = "MBAPPE"

In [38]:
players_df

      name  goals/game  games       goals
0    messi    0.481100    445  214.089282
1   MBAPPE    0.877141    850  745.569750
2  ronaldo    0.298225    641  191.162111
3   MBAPPE    0.886381    934  827.879764

In [39]:
players_df["team"] = ["FC Barca", "PSG", "PSG", "Liverpool"]
players_df

      name  goals/game  games       goals       team
0    messi    0.481100    445  214.089282   FC Barca
1   MBAPPE    0.877141    850  745.569750        PSG
2  ronaldo    0.298225    641  191.162111        PSG
3   MBAPPE    0.886381    934  827.879764  Liverpool

In [41]:
players_df.loc[players_df["team"] == "PSG", "team"] = "Paris St. Germain"
players_df

      name  goals/game  games       goals               team
0    messi    0.481100    445  214.089282           FC Barca
1   MBAPPE    0.877141    850  745.569750  Paris St. Germain
2  ronaldo    0.298225    641  191.162111  Paris St. Germain
3   MBAPPE    0.886381    934  827.879764          Liverpool